


// Ваша функция должна повторять базовый функционал метода flat, но с некоторыми доработками.
//
//   Функция принимает только 1 аргумент — массив,
//
//   Функция возвращает только одномерный массив
//
// Если пользователь передает больше 1-го аргумента, выкидывать ошибку в консоль
//
// throw new Error('Function accepts only 1 argument, too much arguments provided');
// Если в функцию передали многомерный массив то она должна вернуть новый одномерный массив
//
// Если в функцию передали одномерный массив, то она должна вернуть новый массив являющийся полной
// копией переданного
//
// P.S использование метода flat запрещено
//
// P.P.S если найдете пробел или не точность в описании задаче, отпишите мне в телегу и поправим